app/controllers/api/notebooks_controller.rb

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @notebook = Notebook.find(params[:id])

INSERT INTO "notebooks" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["author_id", 1], ["created_at", "2021-05-13 02:48:17.013138"], ["updated_at", "2021-05-13 02:48:17.013138"]]
---
    def create
        @notebook = Notebook.new(notebook_params)
        # debugger
        if @notebook.save