app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "7rJy4n/cokvaqvDFQfWM5A=="], ["updated_at", "2021-05-10 20:27:32.907246"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom::base64
        self.save!