app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "3lXZN8Lq3u/eOowb2y95lg=="], ["updated_at", "2021-05-12 18:09:08.172652"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom::base64
        self.save!